------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/axle73/OneDrive/Stata_works/GitHub/stata-test/dofiles/random_infer_est_ATE.log
  log type:  text
 opened on:  30 Oct 2021, 00:31:30

. 
. * editted by stata and pushed by git desktop
. ** editted again with M1Air - 20211030 00:26
. 
. 
. * load data from working directory
. use "../data/random_infer_est_ATE.dta", clear

. 
. describe

Contains data from ../data/random_infer_est_ATE.dta
 Observations:             7                  
    Variables:             4                  19 Oct 2021 13:28
------------------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------------------------
d               byte    %10.0g                
y               float   %9.0g                 
Y0              float   %9.0g                 
Y1              float   %9.0g                 
------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           d |          7    .2857143      .48795          0          1
           y |          7    17.85714     6.36209         10         30
          Y0 |          5          16      4.1833         10         20
          Y1 |          2        22.5     10.6066         15         30

. list

     +------------------+
     | d    y   Y0   Y1 |
     |------------------|
  1. | 1   15    .   15 |
  2. | 0   15   15    . |
  3. | 0   20   20    . |
  4. | 0   20   20    . |
  5. | 0   10   10    . |
     |------------------|
  6. | 0   15   15    . |
  7. | 1   30    .   30 |
     +------------------+

. 
. * estimate ATE with regression
. regress y d

      Source |       SS           df       MS      Number of obs   =         7
-------------+----------------------------------   F(1, 5)         =      1.65
       Model |  60.3571429         1  60.3571429   Prob > F        =    0.2548
    Residual |       182.5         5        36.5   R-squared       =    0.2485
-------------+----------------------------------   Adj R-squared   =    0.0982
       Total |  242.857143         6  40.4761905   Root MSE        =    6.0415

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           d |        6.5   5.054701     1.29   0.255    -6.493522    19.49352
       _cons |         16   2.701851     5.92   0.002      9.05467    22.94533
------------------------------------------------------------------------------

. 
. 
. * estimate ATE with mean difference
. summarize Y1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          Y1 |          2        22.5     10.6066         15         30

. scalar mean_Y1 = r(mean)

. 
. summarize Y0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          Y0 |          5          16      4.1833         10         20

. scalar mean_Y0 = r(mean)

. 
. scalar ATE_est = mean_Y1 - mean_Y0

. 
. display ATE_est
6.5

. 
. 
. * generate treatment groups with combination C(7,2)
. generate id = _n, before(d)

. list

     +-----------------------+
     | id   d    y   Y0   Y1 |
     |-----------------------|
  1. |  1   1   15    .   15 |
  2. |  2   0   15   15    . |
  3. |  3   0   20   20    . |
  4. |  4   0   20   20    . |
  5. |  5   0   10   10    . |
     |-----------------------|
  6. |  6   0   15   15    . |
  7. |  7   1   30    .   30 |
     +-----------------------+

. 
. save "../data/random_infer_est_ATE_id.dta", replace
file ../data/random_infer_est_ATE_id.dta saved

. 
. combin id, k(2)
         k =          2
         N =          7
Combinations Formed: 21

. list

     +-------------+
     | id_1   id_2 |
     |-------------|
  1. |    1      2 |
  2. |    1      3 |
  3. |    1      4 |
  4. |    1      5 |
  5. |    1      6 |
     |-------------|
  6. |    1      7 |
  7. |    2      3 |
  8. |    2      4 |
  9. |    2      5 |
 10. |    2      6 |
     |-------------|
 11. |    2      7 |
 12. |    3      4 |
 13. |    3      5 |
 14. |    3      6 |
 15. |    3      7 |
     |-------------|
 16. |    4      5 |
 17. |    4      6 |
 18. |    4      7 |
 19. |    5      6 |
 20. |    5      7 |
     |-------------|
 21. |    6      7 |
     +-------------+

. 
. rename id_* trt_*

. list

     +---------------+
     | trt_1   trt_2 |
     |---------------|
  1. |     1       2 |
  2. |     1       3 |
  3. |     1       4 |
  4. |     1       5 |
  5. |     1       6 |
     |---------------|
  6. |     1       7 |
  7. |     2       3 |
  8. |     2       4 |
  9. |     2       5 |
 10. |     2       6 |
     |---------------|
 11. |     2       7 |
 12. |     3       4 |
 13. |     3       5 |
 14. |     3       6 |
 15. |     3       7 |
     |---------------|
 16. |     4       5 |
 17. |     4       6 |
 18. |     4       7 |
 19. |     5       6 |
 20. |     5       7 |
     |---------------|
 21. |     6       7 |
     +---------------+

. 
. save "../data/random_infer_est_trt_combin.dta", replace
file ../data/random_infer_est_trt_combin.dta saved

. 
. 
. * generate control groups with combination C(7,5)
. use "../data/random_infer_est_ATE_id.dta", clear

. 
. combin id, k(5)
         k =          5
         N =          7
Combinations Formed: 21

. list

     +----------------------------------+
     | id_1   id_2   id_3   id_4   id_5 |
     |----------------------------------|
  1. |    1      2      3      4      5 |
  2. |    1      2      3      4      6 |
  3. |    1      2      3      4      7 |
  4. |    1      2      3      5      6 |
  5. |    1      2      3      5      7 |
     |----------------------------------|
  6. |    1      2      3      6      7 |
  7. |    1      2      4      5      6 |
  8. |    1      2      4      5      7 |
  9. |    1      2      4      6      7 |
 10. |    1      2      5      6      7 |
     |----------------------------------|
 11. |    1      3      4      5      6 |
 12. |    1      3      4      5      7 |
 13. |    1      3      4      6      7 |
 14. |    1      3      5      6      7 |
 15. |    1      4      5      6      7 |
     |----------------------------------|
 16. |    2      3      4      5      6 |
 17. |    2      3      4      5      7 |
 18. |    2      3      4      6      7 |
 19. |    2      3      5      6      7 |
 20. |    2      4      5      6      7 |
     |----------------------------------|
 21. |    3      4      5      6      7 |
     +----------------------------------+

. 
. generate ctr_1 = id_5[22 - _n]

. generate ctr_2 = id_4[22 - _n]

. generate ctr_3 = id_3[22 - _n]

. generate ctr_4 = id_2[22 - _n]

. generate ctr_5 = id_1[22 - _n]

. 
. list

     +--------------------------------------------------------------------------+
     | id_1   id_2   id_3   id_4   id_5   ctr_1   ctr_2   ctr_3   ctr_4   ctr_5 |
     |--------------------------------------------------------------------------|
  1. |    1      2      3      4      5       7       6       5       4       3 |
  2. |    1      2      3      4      6       7       6       5       4       2 |
  3. |    1      2      3      4      7       7       6       5       3       2 |
  4. |    1      2      3      5      6       7       6       4       3       2 |
  5. |    1      2      3      5      7       7       5       4       3       2 |
     |--------------------------------------------------------------------------|
  6. |    1      2      3      6      7       6       5       4       3       2 |
  7. |    1      2      4      5      6       7       6       5       4       1 |
  8. |    1      2      4      5      7       7       6       5       3       1 |
  9. |    1      2      4      6      7       7       6       4       3       1 |
 10. |    1      2      5      6      7       7       5       4       3       1 |
     |--------------------------------------------------------------------------|
 11. |    1      3      4      5      6       6       5       4       3       1 |
 12. |    1      3      4      5      7       7       6       5       2       1 |
 13. |    1      3      4      6      7       7       6       4       2       1 |
 14. |    1      3      5      6      7       7       5       4       2       1 |
 15. |    1      4      5      6      7       6       5       4       2       1 |
     |--------------------------------------------------------------------------|
 16. |    2      3      4      5      6       7       6       3       2       1 |
 17. |    2      3      4      5      7       7       5       3       2       1 |
 18. |    2      3      4      6      7       6       5       3       2       1 |
 19. |    2      3      5      6      7       7       4       3       2       1 |
 20. |    2      4      5      6      7       6       4       3       2       1 |
     |--------------------------------------------------------------------------|
 21. |    3      4      5      6      7       5       4       3       2       1 |
     +--------------------------------------------------------------------------+

. 
. drop id_*

. 
. save "../data/random_infer_est_ctr_combin.dta", replace
file ../data/random_infer_est_ctr_combin.dta saved

. 
. 
. * merge treatment and control groups
. use "../data/random_infer_est_trt_combin.dta", clear

. 
. list

     +---------------+
     | trt_1   trt_2 |
     |---------------|
  1. |     1       2 |
  2. |     1       3 |
  3. |     1       4 |
  4. |     1       5 |
  5. |     1       6 |
     |---------------|
  6. |     1       7 |
  7. |     2       3 |
  8. |     2       4 |
  9. |     2       5 |
 10. |     2       6 |
     |---------------|
 11. |     2       7 |
 12. |     3       4 |
 13. |     3       5 |
 14. |     3       6 |
 15. |     3       7 |
     |---------------|
 16. |     4       5 |
 17. |     4       6 |
 18. |     4       7 |
 19. |     5       6 |
 20. |     5       7 |
     |---------------|
 21. |     6       7 |
     +---------------+

. 
. merge 1:1 _n using "../data/random_infer_est_ctr_combin.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                21  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. list

     +-------------------------------------------------------+
     | trt_1   trt_2   ctr_1   ctr_2   ctr_3   ctr_4   ctr_5 |
     |-------------------------------------------------------|
  1. |     1       2       7       6       5       4       3 |
  2. |     1       3       7       6       5       4       2 |
  3. |     1       4       7       6       5       3       2 |
  4. |     1       5       7       6       4       3       2 |
  5. |     1       6       7       5       4       3       2 |
     |-------------------------------------------------------|
  6. |     1       7       6       5       4       3       2 |
  7. |     2       3       7       6       5       4       1 |
  8. |     2       4       7       6       5       3       1 |
  9. |     2       5       7       6       4       3       1 |
 10. |     2       6       7       5       4       3       1 |
     |-------------------------------------------------------|
 11. |     2       7       6       5       4       3       1 |
 12. |     3       4       7       6       5       2       1 |
 13. |     3       5       7       6       4       2       1 |
 14. |     3       6       7       5       4       2       1 |
 15. |     3       7       6       5       4       2       1 |
     |-------------------------------------------------------|
 16. |     4       5       7       6       3       2       1 |
 17. |     4       6       7       5       3       2       1 |
 18. |     4       7       6       5       3       2       1 |
 19. |     5       6       7       4       3       2       1 |
 20. |     5       7       6       4       3       2       1 |
     |-------------------------------------------------------|
 21. |     6       7       5       4       3       2       1 |
     +-------------------------------------------------------+

. 
. save "../data/random_infer_est_sharpNull_base.dta", replace
(file ../data/random_infer_est_sharpNull_base.dta not found)
file ../data/random_infer_est_sharpNull_base.dta saved

. 
. 
. * replace trt_* values with observed results y
. 
. forvalues i = 1/2 {
  2.         replace trt_`i' = 15 if trt_`i' == 1
  3.         replace trt_`i' = 15 if trt_`i' == 2
  4.         replace trt_`i' = 20 if trt_`i' == 3
  5.         replace trt_`i' = 20 if trt_`i' == 4
  6.         replace trt_`i' = 10 if trt_`i' == 5
  7.         replace trt_`i' = 15 if trt_`i' == 6
  8.         replace trt_`i' = 30 if trt_`i' == 7
  9. }
(6 real changes made)
(5 real changes made)
(4 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(3 real changes made)
(4 real changes made)
(5 real changes made)
(6 real changes made)

. 
. * replace ctr_* values with observed results y
. 
. forvalues i = 1/5 {
  2.         replace ctr_`i' = 15 if ctr_`i' == 1
  3.     replace ctr_`i' = 15 if ctr_`i' == 2
  4.     replace ctr_`i' = 20 if ctr_`i' == 3
  5.     replace ctr_`i' = 20 if ctr_`i' == 4
  6.     replace ctr_`i' = 10 if ctr_`i' == 5
  7.     replace ctr_`i' = 15 if ctr_`i' == 6
  8.     replace ctr_`i' = 30 if ctr_`i' == 7
  9. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(5 real changes made)
(15 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(8 real changes made)
(10 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(9 real changes made)
(6 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(10 real changes made)
(8 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(15 real changes made)
(5 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. save "../data/random_infer_est_sharpNull_numeric.dta", replace
(file ../data/random_infer_est_sharpNull_numeric.dta not found)
file ../data/random_infer_est_sharpNull_numeric.dta saved

. 
. 
. * generate ATT, ATU, and ATE 
. generate ATT = (trt_1 + trt_2) / 2, after(trt_2)

. generate ATU = (ctr_1 + ctr_2 + ctr_3 + ctr_4 + ctr_5) / 5

. generate ATE = ATT - ATU

. 
. tabulate ATE 

        ATE |      Freq.     Percent        Cum.
------------+-----------------------------------
       -7.5 |          3       14.29       14.29
         -4 |          5       23.81       38.10
        -.5 |          6       28.57       66.67
          3 |          2        9.52       76.19
        6.5 |          3       14.29       90.48
         10 |          2        9.52      100.00
------------+-----------------------------------
      Total |         21      100.00

. 
. scalar ATE_est = 6.5

. 
. tabulate ATE if ATE >= ATE_est

        ATE |      Freq.     Percent        Cum.
------------+-----------------------------------
        6.5 |          3       60.00       60.00
         10 |          2       40.00      100.00
------------+-----------------------------------
      Total |          5      100.00

. 
. return list

scalars:
                  r(N) =  5
                  r(r) =  2

. 
. display round((r(N) / 21), 0.01)
.24

. 
. save, replace
file ../data/random_infer_est_sharpNull_numeric.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/axle73/OneDrive/Stata_works/GitHub/stata-test/dofiles/random_infer_est_ATE.log
  log type:  text
 closed on:  30 Oct 2021, 00:31:30
------------------------------------------------------------------------------------------------------------------------------------------
